FKDD_COPY_DIFF_3_2026-02-14/Enums/Важность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Важность</Name>
			<Comment>Важность</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Высокая</Name>
					<Comment>Высокая степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Средняя</Name>
					<Comment>Средняя степень важности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Низкая</Name>
					<Comment>Низкая степень важности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/Важность/Ext/ManagerModule.bsl
//возвращает по значению перечисления картинку из библиотеки                
Функция ПолучитьИмяКартинки(ВыбЗначение) Экспорт
	
	Если ТипЗнч(ВыбЗначение) <> ТипЗнч(Перечисления.Важность.ПустаяСсылка()) Тогда
		Возврат "ПриоритетСредний";
	КонецЕсли;
	
	СоответствиеКартинки = Новый Соответствие;
	СоответствиеКартинки.Вставить(Перечисления.Важность.Высокая, 	"ПриоритетВысокий");
	СоответствиеКартинки.Вставить(Перечисления.Важность.Средняя, 	"ПриоритетСредний");
	СоответствиеКартинки.Вставить(Перечисления.Важность.Низкая,		"ПриоритетНизкий");
	
 	ИмяКартинки = СоответствиеКартинки.Получить(ВыбЗначение);
	Если ИмяКартинки = Неопределено Тогда
		Возврат "ПриоритетСредний";
	КонецЕсли;
	
	Возврат ИмяКартинки;
КонецФункции

//возвращает список элементов перечисления 
#Если Клиент Тогда
Функция ПолучитьСписокЭлементовПеречисления() Экспорт
	Список = Новый СписокЗначений;
	Для Каждого ТекПеречисление Из Метаданные.Перечисления.Важность.ЗначенияПеречисления Цикл
		ЗнПеречисление = Перечисления.Важность[ТекПеречисление.Имя];
		ИмяКартинки = ПолучитьИмяКартинки(ЗнПеречисление);
		Список.Добавить(ЗнПеречисление,ТекПеречисление.Синоним,,БиблиотекаКартинок[ИмяКартинки]);	
	КонецЦикла;
	Возврат Список;
КонецФункции
#КонецЕсли
